app/views/cohorts/edit.html.erb

    <%= f.label :course_id %>
    <%= f.collection_select(:course_id, Course.all, :id, :name) %>
---
SELECT "courses".* FROM "courses"

  <%= f.label :teacher_id %>
  <%= f.collection_select(:teacher_id, Teacher.all, :id, :teacher_full_name) %>
---
SELECT "teachers".* FROM "teachers"

  <%= f.label :student_id %>
  <%= f.collection_select(:student_id, Student.all, :id, :student_full_name) %>
---
SELECT "students".* FROM "students"