app/controllers/cohorts_controller.rb

SELECT "cohorts".* FROM "cohorts"
---
  def index
    @cohorts = Cohort.all

SELECT  "cohorts".* FROM "cohorts" WHERE "cohorts"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def show
    @cohort = Cohort.find(params[:id])

SELECT "courses".* FROM "courses"
---
  def new
    @cohort = Cohort.new
    @course = Course.all

SELECT  "cohorts".* FROM "cohorts" WHERE "cohorts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @cohort = Cohort.find(params[:id])

INSERT INTO "cohorts" ("name", "start_date", "end_date", "course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @cohort = Cohort.new(cohort_params)
    if @cohort.save

SELECT  "cohorts".* FROM "cohorts" WHERE "cohorts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cohorts" SET "name" = ?, "updated_at" = ? WHERE "cohorts"."id" = ?  [["name", "weqeHar"], ["updated_at", "2018-06-11 18:37:51.470982"], ["id", 1]]
---
  def update
    @cohort = Cohort.find(params[:id])
   if @cohort.update_attributes(cohort_params)

DELETE FROM "cohorts" WHERE "cohorts"."id" = ?  [["id", 1]]
SELECT  "cohorts".* FROM "cohorts" WHERE "cohorts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    Cohort.find(params[:id]).destroy